<?php
return [
    "拿到手就用了，感觉很不错，质量也没毛病。",
    "货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值。",
    "一个字!!值!!!",
    "掌柜的服务态度很好，发货很快。商品质量也相当不错。太喜欢了，谢谢!",
    "好卖家，真有耐心，我终于买到想要的东西了。谢谢卖家。",

    "掌柜太善良了，真是干一行懂一行呀。在掌柜的指导下我都快变内行人士了!",

    "卖家服务真周到。以后带同事一起来。",

    "宝贝质量不错，很喜欢了。谢谢掌柜。",

    "货到了，比图片上看到的好多了3Q!",

    "真是一个好卖家。以后有这方面宝贝的需求还得找你哦!",

    "很少去评价的，这次是让我很满意很满意，就给老板个五星好评吧，祝老板生意兴隆。",

    "这家店还好吧。来买过几次了，服务老客户非常周到，以后还常来!",

    "忠心地感谢你，让我买到了梦寐以求的宝贝，太感谢了!",

    "经过我的亲身体验，这家店信誉是相当地不错。宝贝的质量更像钻石一般。太感谢了!",

    "不要以为信誉低的卖家货质量不好。我用我的亲身经历告诉大家，掌柜服务态度非常好。商品质量也非常不错。想你了!",

    "呵呵。商品这么快就到了，还不错哦，下次来你可要优惠哦^_^",

    "真没想到网上购物还这么有意思，在卖家的指导下我终于学会了网上购物，谢谢!",

    "老朋友。我又来你店光顾了，久了没来，生意看来还真不错哦。努力哦!",
    "网上购物这么激烈，没想到店家的服务这么好，商品质量好而价低廉，我太感谢你了!",

    "店家很讲信誉，而且很不错哦，在这家店买东东，我很满意~",

    "期盼之中，终于等到了心爱的东东，谢谢!",

    "无意中来到你小铺就淘到心意的宝贝,心情不错!",

    "宝贝收到了，很喜欢，买家很有信用!",

    "有了问题能很好的处理，可以信赖的好店家，以后有机会我们再合作。",

    "赞一个发货迅速，宝贝和图片差不多。。",

    "不错希望下次合作谢谢掌柜~~",

    "价格大众化，YY质量很好呀,款式、面料我都挺满意的.如果有需要我还会继续光顾你的店铺!",

    "不好意思，付款晚了点!",

    "货好，人更好!简单就好!",

    "昨天拿到的，谢谢!",

    "合作愉快，已经确认付款，请查收!",

    "好好好!verygood!",

    "产品很好，服务态度也好!",

    "很好,非常满意!",

    "感谢老板，送个真诚的好评!",

    "终于拿到啦~~好开心啊!",

    "不错，顶一个，谁要你这么诚信呢。。呵呵谢谢咯!",

    "老板性格好，宝贝也好，戴上去也很舒服，超赞.",

    "效果很不错，以后会长期服用。",

    "掌柜人不错。鞋子很好服务很热情。",

    "质量好，以后还来你家买。",

    "很难得的正品，网购以来最满意的了。",

    "做工较细致款式上身比较修身发货速度快是物有所值的一件衣衣谢谢。",

    "很好的卖家。谢谢喽。我的同事们都很喜欢呢。下次再来哦",

    "发货很快，东西不错，有效果",

    "本来有点担心，不过去验证了，是行货，是个好卖家、",

    "服务好!礼品还真是漂亮，超值!但，有一颗小珠有些瑕疵，这是难免的。尺寸比想象中的要小。总体还不错!",

    "卖家的服务挺好的,以后还能做上买卖",


    "不错不错，这样的老板我喜欢~~~~",

    "跟你交易次次都这么成功和开心的..希望我们以后有更多的交易吧...哈哈",

    "好好好尽在不言中.",

    "蛮好的，呵呵，以后继续光顾",

    "还可以，一分价钱一分货",

    "宝贝不错发货很快!",

    "店家货物做工很精美，服务也不错，给好评一个，",

    "发货超快，只是我不在，没能及时签收。赞，赞",

    "很好的卖家,绝对支持",

    "早上收到，很喜欢，下次一定还来",

    "店家发货很速度，一天就到!",

    "谢谢店家，鞋子穿起来很舒服。",

    "衣衣收到了质量不错版型也很好超值",

    "东西收到了，很好哦，很喜欢，赞个",

    "是冲着好评这么多买的，收到后还是有惊喜的，夏天穿刚好。",

    "质量很好，非常不错!",

    "挺好看的",

    "鞋鞋面料做工都很不错鞋型也很漂亮很满意",

    "鞋子很舒服,寄得很快,天就到了..",

    "对鞋子很满意，鞋型不错。",

    "很好的卖家。谢谢喽。我的'同事们都很喜欢呢。下次再来哦",

    "下次上货的时候，弄点鞋腿宽松一点的新款吧，，，，，给多点选择",

    "可美可美~~质量很好~就是里面的杯小了点~其他很perfect",

    "真是很值得哦....什么都很好..",


    "做工很不错··颜色··很好，很漂亮!狂爱!太满意了很舒服的哦还会来的",

    "东西还ok，但是有点脏了，希望下次发货的时候多注意一下",

    "货物还算可以，样式不错，很合身，只是一些细节上还很一般，没有想象中那么好。",

    "老客户了啊，希望以后有更多好东东",

    "还好选大一个码，超修身，很棒!",

    "实物的色和图片稍有差异，但还是挺满意的。",

    "物有所值",

    "店已经收藏了很久，不过是第一次下手。应该说还不错。",

    "卖家人很好这个还没用看包装应该不错",

    "还不错.质量挺好的.速度也快.",

    "没想到这么快就到了，尺寸正好，老板服务热心.",

    "鞋子很好面料很舒服,下次记得送点小礼品哦。",

    "鞋子太棒咯，很喜欢这颜色，另外谢谢long送的袜子lo。",

    "店主挺热情的，看图片防晒衣很大，但是实物挺短的，不会肥大，料子不错，不会闷。穿着很合适，是宽松的，但是不小，满意。",

    "腿直腿瘦的美眉穿出来的效果超好哦!",

    "真的很满意，真的很好。以前是光听麦包包很强大，现在见识到了她的强大。很专业，很规范。包包也很好。我老婆很喜欢。",

    "已经在麦包包买过N个包了，真的是一如既往的好，这个包和图片一样，简单大方、手感柔软，包装也非一般的好、速度也很快，值得给大家推介的一款。。。。",

    "超赞的包，也许是我自恋，反正我就是觉得背起来很有范儿。卖家服务态度也很好，联系了之后马上就给我补发了。Good!另外另外，送的那个零钱包我也很喜欢。真是太贴心了。",

    "店主服务态度很好，很有耐心，包的质量超乎想象，物有所值，这次我用过后才评价，真的不错，值得推广。希望贵店能推出更多的新品种，优惠一下我们，谢谢!",

    "包包不错是我喜欢的那种，皮不像图片那么亮，是有点亚光色的皮，磨砂皮都是有点亚光色的了，包包大气，简洁，网购最满意的一个包包。谢谢小礼物，谢谢客服曼玉。全5分。",

    "包包收到，灰蓝色是自己想要的颜色!相对168身高的我来讲，大包似乎有一点小点，O(∩_∩)O~!这么好的包包会推荐给自己的同事的!",


    "因为出差回来晚了，所以收货也晚了，之前买的时候就跟客服沟通过，怕出差期间同事代收出了问题不能退换之类的，店家完全解除了我的后顾之忧，宝贝拿到后很喜欢，还有送的小礼物也很可爱。还有贴心的小提示，不给全五分，对不起掌柜的，也对不起我自己啊!",

    "买的蓝色，很完美的外包装，物流纸盒+塑料袋+环保布袋;包包里还有厚厚的支撑物，颜色也和图片一样，没有什么线头没有什么瑕疵~。。很喜欢~大爱哈哈",

    "宝贝不错呦。就是感觉不是特别的亮。不过很不错啦，质量好，细节也不错。最爱的是容量大。我最爱大包包!很值得姐妹们投资的一款包包哦!",

    "很漂亮，质量很好发货又快，定了这个以后肯定还来，一百多买个真皮比市场上买的划算多了质量好的没的说超满意",

    "东东包的很好。包比我想的还要大咧。里面可以塞好多东西。里面口袋也很多。小范围旅游带这么一个包都够装了。哈哈。",

    "东西还不错，比想象中的要好。",

    "用了好长一段时间了，今天记起来，顺便给个好评吧，用的很满意，一直没坏。",
];
